<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.78 [en] (Win98; U) [Netscape]">
   <title>Estudio</title>
</head>
<body link="#0000FF" vlink="#800080" background="bckgrnd02.jpg">

<dir><b><font size=+3>Proyectos en Smalltalk de Juan Manuel Vuletich</font></b>
<p>See the <a href="JuanEng.html">English Version</a>
<br><img SRC="image3.gif" height=30 width=528>
<p>Me encanta programar en Smalltalk, en particular en Squeak. Ac&aacute;
puedes encontrar art&iacute;culos, desarrollos y todo lo que tengo para
compartir. Todo lo que hay aqu&iacute; es libre para cualquier uso, sin
obligaciones de tu parte ni garant&iacute;as de mi parte. Lo &uacute;nico
que pido es que me des cr&eacute;dito de la manera que te parezca apropiada.
La versi&oacute;n en ingl&eacute;s tiene algunas cosas que no est&aacute;n
todav&iacute;a en la versi&oacute;n es espa&ntilde;ol.
<p>Squeak es un ambiente Smalltalk novedoso, portable y abierto. Est&aacute;
siendo desarrollado ahora por la misma gente que invent&oacute; la Programaci&oacute;n
Orientada a Objetos y el Smalltalk en la d&eacute;cada del '70. Vea m&aacute;s
en el <a href="http://www.squeak.org">Squeak Home</a>.
<h1>
<font size=+2>PhotoSqueak - Procesamiento de Im&aacute;genes</font></h1>
&nbsp;&nbsp;&nbsp; Esta es la implementaci&oacute;n de los trabajos pr&aacute;cticos
que hice para la materia "Introducci&oacute;n al Procesamiento de Im&aacute;genes"
en la Facultad de Ciencias Exactas y Naturales de la Universidad de Buenos
Aires, durante el 1er cuatrimestre de 2000.
<p>Algunos de los aspectos interesantes de este trabajo incluyen:
<ul>
<li>
Implementaci&oacute;n de un conjunto importante de rutinas para Procesamiento
de Im&aacute;genes</li>

<li>
Uso de Squeak Smalltalk, una herramienta de Objetos</li>

<li>
Construcci&oacute;n de una interfaz al usuario c&oacute;moda y vistosa
en un framework novedoso (Morphic)</li>

<li>
Uso de un recurso de generaci&oacute;n autom&aacute;tica de c&oacute;digo
'C' para crear dlls para las rutinas m&aacute;s pesadas</li>
</ul>

<p><br><a href="PhotoSqueak/PhotoSqueak1/ImageProcessingEsp.html">Ir
Procesamiento de Im&aacute;genes</a>
<p>Atenci&oacute;n. La &uacute;ltima versi&oacute;n de este proyecto est&aacute;
s&oacute;lo accesible desde la versi&oacute;n en ingl&eacute;s de &eacute;sta
p&aacute;gina: <a href="JuanEng.html">English Version.</a>
<h1>
<font size=+2>Squeak para OS/2</font></h1>
Squeak es muy portable, y su comunidad de usuarios lo port&oacute; a muchas
plataformas. Yo escrib&iacute; y mantengo el <a href="SqueakForOS2/SqueakForOS2Esp.html">port
de Squeak a OS/2</a>.
<p><a href="index.html">Elija el lugar de la casa que quiera visitar.</a>
<p><img SRC="image3.gif" height=30 width=528>
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;
<br>&nbsp;</dir>

</body>
</html>
