<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>


  
  
  <meta content="text/html; charset=ISO-8859-1" http-equiv="content-type">


  
  
  <title>Gente de Buena Se&ntilde;al</title>
</head>


<body>


<h1>Gente de BuenaSe&ntilde;al</h1>


<h2>Juan Vuletich</h2>


Soy Licenciado en Ciencias de la Computaci&oacute;n de la UBA.
Adem&aacute;s soy T&eacute;cnico en Electr&oacute;nica y estudi&eacute;
m&uacute;sica. No toco mucho &uacute;ltimamente, pero estoy grabando un
disco de la banda de blues SissiBlues en mi estudio casero basado en PC.<br>


<br>


Me interesan desde hace mucho la ac&uacute;stica y las t&eacute;cnicas
de s&iacute;ntesis y procesamiento de sonido. Escrib&iacute; mis
primeros sintetizadores y samplers a los 16 a&ntilde;os en assembler
6809 en 1987. Hace poco agregu&eacute; filtros resonantes controlados
por envolventes a los sintetizadores de <a href="www.squeak.org">Squeak</a><br>


<br>


Para mi <a href="http://tech.groups.yahoo.com/group/buenasenal/files/Escritos%20de%20miembros%20del%20grupo/">tesis</a>
constru&iacute; una nueva forma de representar sonidos, que es
&uacute;til para procesamiento. Actualmente estoy investigando temas
relacionados. Hace poco fui jurado de una tesis en Australia: "Towards
a Scientific Taxonomy of Musical Styles".<br>


<br>


Tengo una <a href="http://www.jvuletich.org">web personal</a>. Trabajo como programador en Smalltalk.<br>


<br>


Saludos,<br>


Juan Vuletich<br>


<br>


<h2>Hern&aacute;n Ordiales</h2>


Hola, conoc&iacute; a Juan Vuletich en su presentaci&oacute;n de tesis y luego de eso armamos este grupo.<br>

<br>

Me interesan todas las &aacute;reas que tengan que ver con el audio
(desde la ac&uacute;stica al procesamiento de se&ntilde;ales,
aplicaciones musicales o no, etc). En este momento estoy desarrollando
software para el <a href="http://www.lionstracs.com">Mediastation</a> y colaboro con <a href="http://www.musix.org.ar">Musix</a>.<br>

<br>

La semana pasada me enter&eacute; que voy a <a href="http://code.google.com/soc/clam/about.html">participar</a> en el google summer of code! M&aacute;s precisamente dentro del proyecto <a href="http://clam.iua.upf.edu/">CLAM</a>
(un excelente framework para audio y m&uacute;sica). En la web dice que
en algo de speech synthesis, pero voy a hacer otra cosa: "Real-time
spectral transformations"<br>


<br>


Estudio Ing. Electr&oacute;nica (prinicipalmente) en la FIUBA y ahora saqu&eacute; simultaneidad con Inform&aacute;tica.<br>


Trato de volcar todo lo que se/aprendo/me entero en <a href="http://audiores.uint8.com.ar/blog">mi blog sobre audio</a>. Tambi&eacute;n tengo un <a href="http://h.ordia.com.ar/blog">blog personal</a> para todo el resto de las cosas que me interesan (comunicaciones por ej).<br>


<br>


Estudi&eacute; varios a&ntilde;os m&uacute;sica con profesores
particulares y estuve en un par de bandas. Mi instrumento principal es
la guitarra (cualquiera de sus variantes) y tengo un conocimiento
general bastante amplio de estilos, armonia, etc. &Uacute;ltimamente
estoy m&aacute;s (o totalmente) abocado a la parte t&eacute;cnica y
tengo este aspecto bastante de lado.<br>


<br>


Uso GNU/Linux como sistema operativo y tengo que decir que es un camino
de ida... no hay vuelta atr&aacute;s, mi vida profesional es m&aacute;s
c&oacute;moda y agradable desde que migr&eacute; completamente... :-)<br>


Principalmente trabajo con c++ y me estoy metiendo con python (con
agrado). Manejo programaci&oacute;n de microcontroladores y varios
lenguajes de programaci&oacute;n m&aacute;s.<br>


<br>


Conozco a varios de los que est&aacute;n aca suscriptos (ya sea
personalmente o "v&iacute;a email") asi que aprovecho para pedirles que
se presenten!<br>


Con algunos miembros estamos tratando de armar un grupo de
inter&eacute;s que exceda un poco esta lista, hacer reuniones para
presentar temas, ver si podemos "ir m&aacute;s all&aacute;" o
simplemente charlar e intercambiar ideas sobre estas cosas que nos
interesan! (como viene la mano, dentro de poco los suscriptos que no
viven en Argentina hasta podrian participar v&iacute;a streaming!)<br>


Est&aacute;n&nbsp;todos invitados! no hay requerimientos de
conocimientos t&eacute;cnicos, solo se pide inter&eacute;s en el tema y
de ser posible ganas y "pilas" para hacer cosas!<br>


<h2>Bruno Mesz</h2>


Hola a todos, mi nombre es Bruno Mesz, soy licenciado en matematicas,
pianista y clarinetista. Estoy interesado en procesamiento de
se&ntilde;ales, y mas en general en las relaciones entre matematica y
musica.<br>


Bruno <br>


<h2>Francisco Tufr&oacute;</h2>


Buenas. mi nombre es Francisco Tufr&oacute; y soy alumno de la carrera de Ciencias de la Computaci&oacute;n en la UBA.<br>


<br>


Desde siempre me interes&oacute; y movi&oacute; la m&uacute;sica, sobre
todo la m&uacute;sica por computadora, produccion musical y
dem&aacute;s.<br>


<br>


Estuve intentando hacer carreras relacionadas con la m&uacute;sica
electroac&uacute;stica pero todas me decepcionaron por el nivel, no era
lo que yo buscaba... al final decid&iacute; permanecer en Cs. de la
Computaci&oacute;n y estudiar lo que a sonido/m&uacute;sica se refiere
por mi mismo.<br>


<br>


Estoy queriendo meterme en este campo pero desde un punto de vista
m&aacute;s cient&iacute;fico del que lo ven&iacute;a haciendo, el cual
era meramente musical (Tengo un grupo de musica -
http://www.causarock.com.ar -y un proyecto solista -
http://www.tty0.com.ar -), varias personas ya me dijeron que me
suscriba a la lista por estas inquietudes y eso hice...<br>


<br>


Me gustar&iacute;a saber que hacen ustedes, enterarme de que hay en
argentina relacionado con estos temas (sea investigaci&oacute;n en
musica por computadora, DSP, etc.). Yo a&uacute;n estoy adentrandome en
esto y no tengo muy en claro el panorama local.<br>


<br>


Espero sus respuestas y si les robe demasiado tiempo disculpen el ruido...<br>


<br>


Un saludo!<br>


Francisco Tufr&oacute;<br>


<h2>V&iacute;ctor Su&aacute;rez</h2>
Que tal gentes. Me presento. Soy V&iacute;ctor Su&aacute;rez,
estudiante digamos no muy regular o aplicado del depto de
computaci&oacute;n en la UBA.<br>
<br>
Mis intereses y conocimientos se relacionan principalmente con la
programaci&oacute;n, procesamiento de se&ntilde;les de todos los gustos
y sabores que se me interponen, musica digital por decirlo de alguna
manera, electr&oacute;nica (soy t&eacute;cnico electr&oacute;nico y
cada tanto armo algo), y sistemas embebidos. Tambien manejo algunas
t&eacute;cnicas matem&aacute;ticas que aprend&iacute; "a los porrazos".<br>
<br>
Como lenguaje de programaci&oacute;n prefiero el C++ aunque no por
"creerlo mejor que otros" sino porque as&iacute; como es cierra y es el
que mejor conozco y manejo.<br>
<br>
Actualmente estoy trabajando procesando se&ntilde;ales
biol&oacute;gicas para desarrollar equipos de de diagn&oacute;stico
cl&iacute;nico (electromedicina), lo que involucra software, hardware,
matem&aacute;tica, etc. Tambi&eacute;n estoy trabajando procesando
imagenes satelitales con fines de optimizar recursos naturales
(agronom&iacute;a). En otro momento trabaje en lo que podr&iacute;a
llamarse "Arte Digital", lo que involucra instalaciones con sensores de
varios tipos para sistemas interactivos con fines est&eacute;ticos.<br>
<br>
Otros intereses personales son eschucar musica (me gusta lo
instrumental y la improvisaci&oacute;n), la fotograf&iacute;a, cine,
andar en bici.<br>
<br>
Estar&iacute;a bueno que entre todos ademas de aprender podamos armar
"algo que funcione", ya que me interesan bastante las aplicaciones
pr&aacute;cticas de las cosas.<br>
<br>
Saludos!
<h2>Silvio Musolino</h2>


Que tal gente, soy Silvio Musolino y estoy en el grupo de procesamiento
de imagenes de la UBA (FCEN) y cursando mis primeras materias de
imagenes e incursionando en el tema.<br>


<br>


Saludos<br>


<h2>Alejandro Jadzinsky</h2>


Hola, mi nombre es Alejandro, soy m&uacute;sico (compositor) pero con
experiencia en programaci&oacute;n y me intersa el tema, sobre todo en
lo relacionado a desarrollo de software (o algoritmos) para
reconocimiento de patrones.<br>


<br>


Bueno, por ahora nada m&aacute;s, ya postear&eacute; algunas preguntas m&aacute;s adelante y ojal&aacute; pueda responder otras.<br>


<br>


Saludos.<br>


<h2>Antonio Quintero-Rinc&oacute;n (alias Anthony Quinn)</h2>


Hola mi nombre es Antonio Quintero-Rinc&oacute;n soy Ing.
Electr&oacute;nico con Especializaci&oacute;n en Ac&uacute;stica
Arquitect&oacute;nica, adem&aacute;s estudio la Carrera <br>


de Composici&oacute;n con Elementos Electroac&uacute;sticos.<br>


<br>


Pregunta para todos: Qu&eacute; tienen de Active Noise Control?<br>


<br>


Pr&oacute;ximamante subir&eacute; buenos libros de DSP si es que deja este &amp;%$&iquest;"!*?,&nbsp; en fin!<br>


<br>


bueno, un saludo a todos!<br>


<br>


to&ntilde;o quintero<br>


<h2>Janina Rubacha</h2>


Soy Janina Rubacha y hace unos a&ntilde;itos que termin&eacute; la
carrera de Ccias. de la Computaci&oacute;n. La raz&oacute;n para unirme
a este grupo es que hace tiempo que estoy buscando una disciplina que
combine mis dos pasiones: la computaci&oacute;n y la m&uacute;sica.
Ahora que la encontr&eacute; voy a empezar a aprender porque del tema
se poco y nada.<br>


<br>


Saludos!<br>


<br>


Janina<br>


<h2>Esteban Vila</h2>


Soy Esteban y hace un tiempito que me suscribi a la lista con intenciones de aprender algo.<br>


<br>


Saludos!!!!!<br>


<br>


Esteban Vila<br>


<a href="http://spaces.msn.com/members/batanense/">http://spaces.msn.com/members/batanense/</a><br>


<h2>Marcos Guglielmetti </h2>


<a href="www.musix.org.ar">Musix GNU+Linux</a><br>


<a href="www.incasol.org.a">INCASOL</a> <br>


<a href="http://rosegarden.sourceforge.net/tutorial/">Rosegarden Tutorial</a><br>


<br>


Simplemente saludarlos, conoc&iacute; a Hern&aacute;n y me sugiri&oacute; que me uniera. <br>


<br>


Felicitaciones por la idea!<br>


<br>


Espero que podamos hacer cosas interesantes.<br>


<br>


Hasta Luego!<br>


<h2>Carlos Sandoval</h2>


Les saluda Carlos Sandoval, compositor mexicano radicado en Berlin,
concentrado en desarrollar sistemas de electronica en vivo combinasdas
con DSP. <br>


<br>


Saludos y felicidades por el grupo!<br>


<br>


<a href="www.carlos-sandoval.de/gloves.htm">www.carlos-sandoval.de/gloves.htm</a><br>


<h2>Mart&iacute;n Javier Carr&aacute;</h2>


Buenas:<br>


<br>


Que tal, bueno en ppio me presento.<br>


<br>


Me llamo mart&iacute;n carr&aacute; y estoy estudiando ing en
electr&oacute;nica en la uba y estoy interesado en crear un software
para realizar los mismos efectos que las pedaleras para guitarra pero
por software. Alguien tiene idea por donde empezar?<br>


<br>


Bueno y si alguien tiene ganas de coparse...&nbsp; pues bienvenido sean!!!!<br>


<br>


Abrazo a todos!!!!<br>


<h2>Jos&eacute; Ricardo Zapata</h2>


Hola, soy ingeniero electronico.<br>


<h2>Juan Pablo Sastre</h2>


Usuario / colaborador de Musix GNU+Linux, 100% Software Libre<br>
Soy Juan Pablo Sastre; me dicen Cacho en el taller de serigraf&iacute;a
de unos vecinos; mi historial de estudios es el siguiente; no se crean
que es mucho; comenze Medicina apenas egresado de la escuela
secundaria, y vi&eacute;ndome desubicado en clase de anatom&iacute;a,
despues de haber logrado ingresar a la Facultad mas dif&iacute;cil para
esto, en la universidad nacional de C&oacute;rdoba (argentina).<br>
<br>
Luego; en 1995; hago mi ingreso a la Universidad Tecnol&oacute;gica
Nacional; Facultad Regional C&oacute;rdoba; a la carrera de Ing.
Electronica; y despues que me acribillaran con Analisis Matematico,
&Aacute;lgebra y Geometr&iacute;a anal&iacute;tica; es que comienzo
otra vez.<br>
<br>
Testarudo yo; que otra vez; me tiraron a matar; vuelta a comenzar. Y;
aparentemente; les gane por cansancio a los profes; y aprobe al fin; en
el tercer intento. Teniendo en cuenta que si no se aprueba; hay que
volver a cursar.<br>
<br>
Aunque despues de ir avanzando en la carrera; veo que se aleja
demasiado de mi objetivo de orientarme a lo que a sonido se refiere;
sin mas motivaci&oacute;n y esperanzas (uuu; suena terrible; jeje)
decido dejar la carrera.<br>
<br>
Despues de andar medio en los suburbios del sonido; logro entrar en una
productora de TV de mi ciudad; aunque no en una de las grandes; pero ya
<br>
trabajando en modo pro.<br>
<br>
Y en estos &uacute;ltimos tiempos ando trabajando tambi&eacute;n en un
peque&ntilde;o estudio de un amigo; el cual le dise&ntilde;e y realice
la "acustizacion" del local.<br>
Parece que quiere agrandarse; estamos haciendo un par de producciones a gente local; de mediana proyecci&oacute;n.<br>
<br>
Soy de la provincia de C&oacute;rdoba; la del "cantito" y el humor a
flor de piel; por eso si leen algo medio extra&ntilde;o; seguro es un
chiste; sino, me preguntan.<br>
<br>
Nos vemos<br>


<h2>Adri&aacute;n (Pardo)</h2>


Soy Adri&aacute;n, desde hace unos 8 a&ntilde;os todo el mundo me dice
pardo, incluso algunos creen que ese es mi nombre real. Tengo 20
a&ntilde;os, acabo de terminar tercero de ingenier&iacute;a en
electr&oacute;nica y empec&eacute; licenciatura en inform&aacute;tica
en la UNLP.<br>


<br>


Cuando tengo un ratito colaboro con Musix. Bailo tango, trabaj&eacute;
el verano pasado de taxidancer, estoy viendo de traer la movida del
tango queer a La Plata con un amigo. Ando bastante en bicicleta y a
veces salgo de noche a caminar o correr.<br>


<br>


Tengo gustos musicales muy diversos, ahora por nombrar algo me sale
Utada Hikaru, Cardigans, Nina Gordon / Veruca Salt, Fleur, Children Of
Bodom, Tanghetto, Symphony X, Garbage, Aqualung, Secret Sphere, Lara
Fabian, Everclear, Astillero, MxPx, Coldplay, Curve, Natalie Imbruglia,
Karina Luzabril, Angelina Shabalina, etc.<br>


<br>


Soy bastante conservador en cuanto a los juegos, buscaminas, mahjongg,
UT Doom, juegos de ficci&oacute;n interactiva y cosas como nethack o
moria. Tambi&eacute;n los viejitos como indiana jones, Zack McKracken o
metal mutant.<br>


<br>


Por ahora estoy trabajando en una consola midi hecha con mice viejos y
un framework para IPC sobre sockets unix de baja latencia. Este 2007
tengo tambi&eacute;n una beca como investigador en "Nuevas
Tecnolog&iacute;as, competencias profesionales y educaci&oacute;n
cient&iacute;fica. Estrategias did&aacute;cticas para su
articulaci&oacute;n."<br>


<br>


Bueno, un saludo; supongo que esto terminar&aacute; de aclarar cualquier duda.<br>


<h2>Alfredo Fontana</h2>


Hola, quer&iacute;a subscribirme de curioso. Vi unos mails y d&iacute;
con la p&aacute;gina de Juan Vuletich (Asist&iacute; a su tesis).<br>


<br>


Saludos... Alfredo <br>


<h2>AndresSenial</h2>


Soy estudiante de computacion.<br>


<br>


Estoy interesado en el procesamiento de se&ntilde;ales imagenes y audio (tan iguales y distintas a la vez).<br>


<br>


Busco tema para mi tesis.<br>


<br>


Espero que haya un lugar para mi.<br>
<br>
<h2>C&eacute;sar Augusto Perez</h2>
Hola, soy C&eacute;sar, de Medellin, Colombia. En estos momenos estoy
terminando mi trabajo de grado en ing. electronica de la Universidad
Pontificia Bolivariana, ademas de esto soy guitarrista y productor
desde hace un buen tiempo.<br>
<h2>Carlos Iris</h2>
Hola, Soy camionero y hace unos a&ntilde;os tuve un accidente grave y
me golpe&eacute; la cabeza. Tuve fractura de cr&aacute;neo con
p&eacute;rdida de masa encef&aacute;lica. Me colocaron una placa de
titanio para cubrir hueso del cr&aacute;neo destruido. Me
recuper&eacute; bastante bien a pesar de lo grave del accidente.
Empec&eacute; a caminar despu&eacute;s de una larga recuperaci&oacute;n
y volv&iacute; al trabajo, ya no conduzco el cami&oacute;n pero sigo en
la empresa atendiendo a proveedores en las oficinas.<br>
<br>
Pero a partir de un d&iacute;a comenc&eacute; a oir voces en mi cabeza.
Estas voces hablaban cosas bastante extra&ntilde;as y llegaron a
preocuparme. Por momentos tambi&eacute;n o&iacute;a m&uacute;sica.
Consult&eacute; varios m&eacute;dicos y sic&oacute;logos que me
hicieron muchos an&aacute;lisis pero no pudieron curarme.<br>
<br>
Al cabo de un tiempo me d&iacute; cuenta que no eran voces sino
programas de radio. No se como, pero la placa de titanio act&uacute;a
como antena y para colmo est&aacute; sintonizada en una radio fachista
que detesto.<br>
<br>
Como puedo curarme ?O al menos como cambiar la sinton&iacute;a ?<br>
<br>
...<br>
<br>
Hola Juan. Yo no figuro en la lista. Quiz&aacute;s no quisiste publicar
mi historia por discreci&oacute;n y respeto por mi enfermedad. Si es
as&iacute; desde ya te lo agradezco y te autorizo a publicarla si
as&iacute; lo deseas.<br>
<br>
Si nos cruzamos en la calle podr&aacute;s reconocerme, porque
(siguiendo tu consejo y el de Jose Carlos Fuentes (quien tampoco figura
en la lista) ) voy a todos lados con un abultado gorro forrado en papel
metalizado.
</body>
</html>
